---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBreakAtInsertsDisable
source: html/824b6fbd-c6ec-c6d8-0c26-b6f5f67b9052.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBreakAtInsertsDisable Property

"Do Not Break At Inserts"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingBreakAtInsertsDisable { get; }
```